#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pubsub_repo_sqlite.github_branch_default.master will be created
  + resource "github_branch_default" "master" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "watermill-sqlite"
    }

  # module.pubsub_repo_sqlite.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "SQLite Pub/Sub for the Watermill project."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = true
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://watermill.io/pubsubs/sqlite/"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "watermill-sqlite"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.pubsub_repo_sqlite.github_repository_file.pull_request_template will be created
  + resource "github_repository_file" "pull_request_template" {
      + branch              = "master"
      + commit_message      = "Update .github/pull_request_template.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            <!--
            Thanks for contributing to Watermill!
            
            The following template aims to help contributors write a good description for their pull requests.
            **The more information you provide, the faster we will be able to review and merge your PR.**
            
            Feel free to skip this template for minor changes like typo fixes.
            
            -->
            
            ### Motivation / Background
            
            <!--
            
            Explain the purpose of this Pull Request:
            - What issue or bug does it address?
            - What new functionality does it add?
            - Why are these changes needed?
            For bug fixes, include "Fixes #ISSUE" to automatically link to the related issue.
            
            -->
            
            ### Details
            
            <!-- Describe how you solved the problem or implemented the feature. -->
            
            ### Alternative approaches considered (if applicable)
            
            <!-- If applicable, describe alternative approaches you considered and why you chose this one. -->
            
            ### Checklist
            
            The resources of our team are limited. **There are a couple of things that you can do to help us merge your PR faster**:
            
            - [ ] I wrote tests for the changes.
            - [ ] All tests are passing.
              - If you are testing a Pub/Sub, you can start Docker with `make up`.
              - You can start with `make test_short` for a quick check.
              - If you want to run all tests, use `make test`.
            - [ ] Code has no breaking changes.
            - [ ] _(If applicable)_ documentation on [watermill.io](https://watermill.io/) is updated.
              - Documentation is built in the [github.com/ThreeDotsLabs/watermill/docs](https://github.com/ThreeDotsLabs/watermill/tree/master/docs).
              - You can find development instructions in the [DEVELOP.md](https://github.com/ThreeDotsLabs/watermill/tree/master/docs/DEVELOP.md).
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-sqlite"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_sqlite.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill SQLite Pub/Sub
            <img align="right" width="200" src="https://watermill.io/img/gopher.svg">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-sqlite/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-sqlite/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-sqlite)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-sqlite)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-sqlite"
      + sha                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by @roblaszczak*